// data structure :use it like hash to get data
// 多级的默认显示
// 减小数据的体积
// 只要键值对应，不要求命名。

export const data = {
  1: {
    10: '水果',
    20: '蔬菜',
    30: '饮料',
    40: '矿泉水',
  },
  10: {
    100: '苹果',
    101: '香蕉',
    103: '樱桃',
  },
  20: {
    200: '土豆',
    201: '大蒜',
    202: '茄子',
  },
  30: {
    300: '啤酒',
    301: '白酒',
    302: '威士忌'
  },
  40: {
    '价格': '100亿',
  },
  100: {
    1000: '一种',
    1001: '两种',
  },
  200: {
    2000: '马铃薯',
    2001: '大土豆',
  },
  1000: {
    10001: '200玩',
    10002: '300网',
    10003: '400网',
    10004: '500网',
    10005: '600网',
    10006: '700网',
  }
}
